+posts/lang/c-c++/acid_naming.org
#+INCLUDE: ../../../+layouts/header.org
#+TITLE: Acid Naming Problem

* Table of contents                                       :TOC_4_gh:noexport:
- [[#the-problem-statement][The Problem Statement]]
  - [[#input][Input]]
  - [[#output][Output]]
- [[#conditions][Conditions]]
- [[#test-case][Test Case]]
- [[#what-do-we-need-to-know][What do we need to know?]]
- [[#lets-begin][Let's begin!]]
  - [[#what-should-be-the-maximum-length-of-an-acid-name][What should be the maximum length of an ~acid name~?]]
  - [[#what-method-should-we-use-for-getting-the-acid-names-from-user][What method should we use for getting the ~acid names~ from user?]]
  - [[#how-do-we-check-whether-the-input-starts-with-hydro-or-not][How do we check whether the input starts with ~hydro~ or not?]]
  - [[#how-to-check-if-acid-name-ends-with-ic][How to check if ~acid name~ ends with "ic"?]]
  - [[#connecting-the-dots][Connecting the dots...]]
  - [[#finally-here-comes-the-main-function][Finally, Here comes the ~main~ function!]]
- [[#thank-you][Thank You!]]

* The Problem Statement
Jonathan is in a science class, but because he does not understand how to name
acids, he would like you to make a program for him. There are two types of acids
at his level, /non-metal/ and /polyaomic/.

Conditions for naming an acid:

- If the given input starts with ~hydro~ and ends with ~ic~ then it is a ~non-metal
  acid~.
- If the input only ends with ~ic~ then it is a ~polyatomic acid~.
- If it does not have either case, then output ~not an acid~.

For example, for the input, *hydrochloric*, the correct output is - /non-metal acid/ as the input begins with
~hydro~ and ends with ~ic~.

Complete the function acidNaming which takes a string input with the name of the
acid, and return a string describing the appropriate type of acid.

** Input
The first line will contain an integer *q*.
The next *q* lines will contain a single word *s*.

** Output
- If the word starts with ~hydro~ and ends with ~ic~ then it is a non-metal acid.
  Hence, the correct output is - /non-metal acid/.
- If the word only ends with ~ic~ then it is a polyatomic acid. Hence, the correct
  output is /polyatomic acid/.
- If the word does not meet any of the cases, then the correct output is /not an acid/.

* Conditions
- *1* <= *q* <= *100.*
- Word *s* is made up of lower-case english letters.
- *2* <= *length of s* <= *10^4*.

* Test Case
Input

|---------------|
| 3             |
| hydrochloric  |
| rainbowic     |
| idontevenknow |
|---------------|

Output

|-----------------|
| non-metal acid  |
| polyatomic acid |
| not an acid     |
|-----------------|

* What do we need to know?
- What should be the maximum length of an ~Acid~ name?
- What method should we use for getting the ~acid names~ from user?
- How do we check whether the input starts with ~hydro~ or not?

* Let's begin!
** What should be the maximum length of an ~acid name~?
In the constraints section, it is given that:

- *2* <= *length of s* <= *10^4*.

So, the ~acid name~ can have minimum *2* and maximum *10000* characters.

** What method should we use for getting the ~acid names~ from user?
As the ~acid names~ are english words, so we will use ~char array or string~
datatype. Now to populate the array with user input, There are couple of ways:

- Either we directly get the input using ~scanf~ and then process the string for a
  valid acid.

But this way, we would be using *2 loops* (1 via ~scanf~ to *get the  input*,
another to *traverse the string again to process it*) which is not an efficient
way. That too when we want to reduce the ~Time Complexity~ in competetive
programming environment.

So?

We would get the input character-by-character and process it there within. This
way only 1 loop will do our whole job.

#+begin_src C
  int character;
  int charCount = 0;
  
  char acidName[10001];

  while ((character = getchar()) != '\n') {
    acidName[charCount++] = character;

    // Rest of the code goes here.
  }
#+end_src

#+begin_note
Even though the maximum ~acid name~ should be equal-to/less-than 10000 characters, but we used:

~acidName[10001];~

That's because, 1 extra Byte would store ~'\0'~ (null) i.e. the string end indicator.
#+end_note

