lang/c-c++/acid_naming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-21 Wed 19:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Acid Naming Problem</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shubham Mahajan" />
<link rel="icon" type="image/png" href="https://imahajanshubham.github.io/docs/+assets/favicon.webp">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://imahajanshubham.github.io/docs/+themes/custom.css" />
</head>
<body>
<div id="content">
<h1 class="title">Acid Naming Problem</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd18eae4">The Problem Statement</a>
<ul>
<li><a href="#org803b441">Input</a></li>
<li><a href="#org55b9a42">Output</a></li>
</ul>
</li>
<li><a href="#org6eb7eb5">Conditions</a></li>
<li><a href="#org5d996b2">Test Case</a></li>
<li><a href="#org0bdce5e">What do we need to know?</a></li>
<li><a href="#org37a3094">Let's begin!</a>
<ul>
<li><a href="#orgc32c198">What should be the maximum length of an <code>acid name</code>?</a></li>
<li><a href="#orgaa6f62d">What method should we use for getting the <code>acid names</code> from user?</a></li>
<li><a href="#org751d83e">How do we check whether the input starts with <code>hydro</code> or not?</a></li>
<li><a href="#orgbf54d41">How to check if <code>acid name</code> ends with "ic"?</a></li>
<li><a href="#orgb986950">Connecting the dots&#x2026;</a></li>
<li><a href="#org3df120a">Finally, Here comes the <code>main</code> function!</a></li>
</ul>
</li>
<li><a href="#org0695c46">Thank You!</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="100% class=&quot;center&quot; background=“white”">


<colgroup>
<col  class="org-center" />

<col  class="org-center" />

<col  class="org-center" />
</colgroup>
<tbody>
<tr>
<td class="org-center"><a href="https://imahajanshubham.github.io/docs/home.html">Home</a></td>
<td class="org-center"><a href="https://github.com/imahajanshubham">GitHub</a></td>
<td class="org-center"><a href="https://sites.google.com/view/the-launchpad/home">Website</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-orgd18eae4" class="outline-2">
<h2 id="orgd18eae4">The Problem Statement</h2>
<div class="outline-text-2" id="text-orgd18eae4">
<p>
Jonathan is in a science class, but because he does not understand how to name
acids, he would like you to make a program for him. There are two types of acids
at his level, <i>non-metal</i> and <i>polyaomic</i>.
</p>

<p>
Conditions for naming an acid:
</p>

<ul class="org-ul">
<li>If the given input starts with <code>hydro</code> and ends with <code>ic</code> then it is a <code>non-metal
  acid</code>.</li>
<li>If the input only ends with <code>ic</code> then it is a <code>polyatomic acid</code>.</li>
<li>If it does not have either case, then output <code>not an acid</code>.</li>
</ul>

<p>
For example, for the input, <b>hydrochloric</b>, the correct output is - <i>non-metal acid</i> as the input begins with
<code>hydro</code> and ends with <code>ic</code>.
</p>

<p>
Complete the function acidNaming which takes a string input with the name of the
acid, and return a string describing the appropriate type of acid.
</p>
</div>

<div id="outline-container-org803b441" class="outline-3">
<h3 id="org803b441">Input</h3>
<div class="outline-text-3" id="text-org803b441">
<p>
The first line will contain an integer <b>q</b>.
The next <b>q</b> lines will contain a single word <b>s</b>.
</p>
</div>
</div>

<div id="outline-container-org55b9a42" class="outline-3">
<h3 id="org55b9a42">Output</h3>
<div class="outline-text-3" id="text-org55b9a42">
<ul class="org-ul">
<li>If the word starts with <code>hydro</code> and ends with <code>ic</code> then it is a non-metal acid.
Hence, the correct output is - <i>non-metal acid</i>.</li>
<li>If the word only ends with <code>ic</code> then it is a polyatomic acid. Hence, the correct
output is <i>polyatomic acid</i>.</li>
<li>If the word does not meet any of the cases, then the correct output is <i>not an acid</i>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6eb7eb5" class="outline-2">
<h2 id="org6eb7eb5">Conditions</h2>
<div class="outline-text-2" id="text-org6eb7eb5">
<ul class="org-ul">
<li><b>1</b> &lt;= <b>q</b> &lt;= <b>100.</b></li>
<li>Word <b>s</b> is made up of lower-case english letters.</li>
<li><b>2</b> &lt;= <b>length of s</b> &lt;= <b>10<sup>4</sup></b>.</li>
</ul>
</div>
</div>

<div id="outline-container-org5d996b2" class="outline-2">
<h2 id="org5d996b2">Test Case</h2>
<div class="outline-text-2" id="text-org5d996b2">
<p>
Input
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">3</td>
</tr>

<tr>
<td class="org-left">hydrochloric</td>
</tr>

<tr>
<td class="org-left">rainbowic</td>
</tr>

<tr>
<td class="org-left">idontevenknow</td>
</tr>
</tbody>
</table>

<p>
Output
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">non-metal acid</td>
</tr>

<tr>
<td class="org-left">polyatomic acid</td>
</tr>

<tr>
<td class="org-left">not an acid</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0bdce5e" class="outline-2">
<h2 id="org0bdce5e">What do we need to know?</h2>
<div class="outline-text-2" id="text-org0bdce5e">
<ul class="org-ul">
<li>What should be the maximum length of an <code>Acid</code> name?</li>
<li>What method should we use for getting the <code>acid names</code> from user?</li>
<li>How do we check whether the input starts with <code>hydro</code> or not?</li>
</ul>
</div>
</div>

<div id="outline-container-org37a3094" class="outline-2">
<h2 id="org37a3094">Let's begin!</h2>
<div class="outline-text-2" id="text-org37a3094">
</div>
<div id="outline-container-orgc32c198" class="outline-3">
<h3 id="orgc32c198">What should be the maximum length of an <code>acid name</code>?</h3>
<div class="outline-text-3" id="text-orgc32c198">
<p>
In the constraints section, it is given that:
</p>

<ul class="org-ul">
<li><b>2</b> &lt;= <b>length of s</b> &lt;= <b>10<sup>4</sup></b>.</li>
</ul>

<p>
So, the <code>acid name</code> can have minimum <b>2</b> and maximum <b>10000</b> characters.
</p>
</div>
</div>

<div id="outline-container-orgaa6f62d" class="outline-3">
<h3 id="orgaa6f62d">What method should we use for getting the <code>acid names</code> from user?</h3>
<div class="outline-text-3" id="text-orgaa6f62d">
<p>
As the <code>acid names</code> are english words, so we will use <code>char array or string</code>
datatype. Now to populate the array with user input, There are couple of ways:
</p>

<ul class="org-ul">
<li>Either we directly get the input using <code>scanf</code> and then process the string for a
valid acid.</li>
</ul>

<p>
But this way, we would be using <b>2 loops</b> (1 via <code>scanf</code> to <b>get the  input</b>,
another to <b>traverse the string again to process it</b>) which is not an efficient
way. That too when we want to reduce the <code>Time Complexity</code> in competetive
programming environment.
</p>

<p>
So?
</p>

<p>
We would get the input character-by-character and process it there within. This
way only 1 loop will do our whole job.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">character</span>;
<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">charCount</span> = <span style="color: #4e3163;">0</span>;

<span style="color: #ba2f59; font-weight: bold;">char</span> <span style="color: #715ab1;">acidName</span><span style="color: #3a81c3;">[</span><span style="color: #4e3163;">10001</span><span style="color: #3a81c3;">]</span>;

<span style="color: #3a81c3; font-weight: bold;">while</span> <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">(</span>character = getchar<span style="color: #2d9574;">()</span><span style="color: #6c3163;">)</span> != <span style="color: #2d9574;">'\n'</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  acidName<span style="color: #6c3163;">[</span>charCount++<span style="color: #6c3163;">]</span> = character;

  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Rest of the code goes here.</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<div class="note">
<p>
Even though the maximum <code>acid name</code> should be equal-to/less-than 10000 characters, but we used:
</p>

<p>
<code>acidName[10001];</code>
</p>

<p>
That's because, 1 extra Byte would store <code>'\0'</code> (null) i.e. the string end indicator.
</p>

</div>
</div>
</div>
