+posts/lang/c-c++/acid_naming.org
** How do we check whether the input starts with ~hydro~ or not?
To check whether the input starts with ~hydro~ or not, we'll take help of a *flag*
which would tell us if we've encountered ~hydro~ in our input or not.

Now, if we are getting the input character-by-character then why not simply do:

#+begin_src C
  if ((character = getchar()) == 'h') {
    acidName[charCount++] = character;

    if ((character = getchar()) == 'y') {
      acidName[charCount++] = character;

      if ((character = getchar()) == 'd') {
        acidName[charCount++] = character;

        if ((character = getchar()) == 'r') {
          acidName[charCount++] = character;

          if ((character = getchar()) == 'o') {
            acidName[charCount++] = character;

            flag = 1;
          }

          else flag = 0;
        }
      }
    }
  }
#+end_src

Because this is a very unorthodox approach and there is too much use of ~if statements~.
Imagine if need to compare the input with 100+ characters... phew!!!

So, Let's use one of the possible better approach:

#+begin_src C
  int flag = 0;

  int character;
  int charCount = 0;

  char acidName[10001];

  while ((character = getchar()) != '\n') {
    acidName[charCount++] = character;

    if (charCount == 5) {
      if (!strcmp(acidName, "hydro"))
        hasStart = 1;
    }
  }
#+end_src

Only 2 ~if statements~ did the trick, no matter how long the comparison string is.
*Also, notice* why we used ~! i.e. (NOT operator)~ in ~!strcmp(...)~.

#+begin_tip
The library function ~strcmp~ defined in *string.h* file is used to compare two
strings based upon the ASCII values of their characters.

Syntax: ~strcmp(string1, string2)~

So, it returns:
- *0*   - if both the strings are equal.
- *+ve* - if first string is greater than second (numerically).
- *-ve* - vice-versa.
#+end_tip

So, we took advantage of it's first return value i.e. it returns *0* when both
strings are equal.

In general,

#+begin_src C
  if (n) {
    // code
  }
#+end_src

means, *n* is not equal to *0*? True, so it'll enter the the *if-body*. But what if
want to say, *n* equal to *0*?

#+begin_src C
  if (n == 0) {
    // code
  }
#+end_src

or, we use ~!~ operator to achieve the same:

#+begin_src C
  if (!n) {
    // code
  }
#+end_src

Now,

** How to check if ~acid name~ ends with "ic"?
To check if ~acide name~ ends with *"ic"* or not, we will compare *n - 2th* index of
the ~acid name~.

#+begin_src C
  while ((character = getchar()) != '\n') {
    acidName[charCount++] = character;

    if (charCount == 5) {
      if (!strcmp(acidName, "hydro"))
        hasStart = 1;
    }
   }

  acidName[charCount] = '\0';

  if (charCount >=2 && !strcmp(&acidName[charCount - 2], "ic"))
    hasEnd = 1;
#+end_src

