lang/c-c++/acid_naming.html

<div id="outline-container-org751d83e" class="outline-3">
<h3 id="org751d83e">How do we check whether the input starts with <code>hydro</code> or not?</h3>
<div class="outline-text-3" id="text-org751d83e">
<p>
To check whether the input starts with <code>hydro</code> or not, we'll take help of a <b>flag</b>
which would tell us if we've encountered <code>hydro</code> in our input or not.
</p>

<p>
Now, if we are getting the input character-by-character then why not simply do:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">(</span>character = getchar<span style="color: #2d9574;">()</span><span style="color: #6c3163;">)</span> == <span style="color: #2d9574;">'h'</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  acidName<span style="color: #6c3163;">[</span>charCount++<span style="color: #6c3163;">]</span> = character;

  <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>character = getchar<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span> == <span style="color: #2d9574;">'y'</span><span style="color: #6c3163;">)</span> <span style="color: #6c3163;">{</span>
    acidName<span style="color: #2d9574;">[</span>charCount++<span style="color: #2d9574;">]</span> = character;

    <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>character = getchar<span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span> == <span style="color: #2d9574;">'d'</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
      acidName<span style="color: #67b11d;">[</span>charCount++<span style="color: #67b11d;">]</span> = character;

      <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>character = getchar<span style="color: #3a81c3;">()</span><span style="color: #b1951d;">)</span> == <span style="color: #2d9574;">'r'</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
        acidName<span style="color: #b1951d;">[</span>charCount++<span style="color: #b1951d;">]</span> = character;

        <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span><span style="color: #3a81c3;">(</span>character = getchar<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span> == <span style="color: #2d9574;">'o'</span><span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
          acidName<span style="color: #3a81c3;">[</span>charCount++<span style="color: #3a81c3;">]</span> = character;

          flag = <span style="color: #4e3163;">1</span>;
        <span style="color: #b1951d;">}</span>

        <span style="color: #3a81c3; font-weight: bold;">else</span> flag = <span style="color: #4e3163;">0</span>;
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Because this is a very unorthodox approach and there is too much use of <code>if statements</code>.
Imagine if need to compare the input with 100+ characters&#x2026; phew!!!
</p>

<p>
So, Let's use one of the possible better approach:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">flag</span> = <span style="color: #4e3163;">0</span>;

<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">character</span>;
<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">charCount</span> = <span style="color: #4e3163;">0</span>;

<span style="color: #ba2f59; font-weight: bold;">char</span> <span style="color: #715ab1;">acidName</span><span style="color: #3a81c3;">[</span><span style="color: #4e3163;">10001</span><span style="color: #3a81c3;">]</span>;

<span style="color: #3a81c3; font-weight: bold;">while</span> <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">(</span>character = getchar<span style="color: #2d9574;">()</span><span style="color: #6c3163;">)</span> != <span style="color: #2d9574;">'\n'</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  acidName<span style="color: #6c3163;">[</span>charCount++<span style="color: #6c3163;">]</span> = character;

  <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span>charCount == <span style="color: #4e3163;">5</span><span style="color: #6c3163;">)</span> <span style="color: #6c3163;">{</span>
    <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span><span style="color: #4e3163;">!</span>strcmp<span style="color: #67b11d;">(</span>acidName, <span style="color: #2d9574;">"hydro"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
      hasStart = <span style="color: #4e3163;">1</span>;
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Only 2 <code>if statements</code> did the trick, no matter how long the comparison string is.
<b>Also, notice</b> why we used <code>! i.e. (NOT operator)</code> in <code>!strcmp(...)</code>.
</p>

<div class="tip">
<p>
The library function <code>strcmp</code> defined in <b>string.h</b> file is used to compare two
strings based upon the ASCII values of their characters.
</p>

<p>
Syntax: <code>strcmp(string1, string2)</code>
</p>

<p>
So, it returns:
</p>
<ul class="org-ul">
<li><b>0</b>   - if both the strings are equal.</li>
<li><b>+ve</b> - if first string is greater than second (numerically).</li>
<li><b>-ve</b> - vice-versa.</li>
</ul>

</div>

<p>
So, we took advantage of it's first return value i.e. it returns <b>0</b> when both
strings are equal.
</p>

<p>
In general,
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span>n<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">code</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
means, <b>n</b> is not equal to <b>0</b>? True, so it'll enter the the <b>if-body</b>. But what if
want to say, <b>n</b> equal to <b>0</b>?
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span>n == <span style="color: #4e3163;">0</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">code</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
or, we use <code>!</code> operator to achieve the same:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">!</span>n<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">code</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Now,
</p>
</div>
</div>

<div id="outline-container-orgbf54d41" class="outline-3">
<h3 id="orgbf54d41">How to check if <code>acid name</code> ends with "ic"?</h3>
<div class="outline-text-3" id="text-orgbf54d41">
<p>
To check if <code>acide name</code> ends with <b>"ic"</b> or not, we will compare <b>n - 2th</b> index of
the <code>acid name</code>.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #3a81c3; font-weight: bold;">while</span> <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">(</span>character = getchar<span style="color: #2d9574;">()</span><span style="color: #6c3163;">)</span> != <span style="color: #2d9574;">'\n'</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  acidName<span style="color: #6c3163;">[</span>charCount++<span style="color: #6c3163;">]</span> = character;

  <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span>charCount == <span style="color: #4e3163;">5</span><span style="color: #6c3163;">)</span> <span style="color: #6c3163;">{</span>
    <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span><span style="color: #4e3163;">!</span>strcmp<span style="color: #67b11d;">(</span>acidName, <span style="color: #2d9574;">"hydro"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
      hasStart = <span style="color: #4e3163;">1</span>;
  <span style="color: #6c3163;">}</span>
 <span style="color: #3a81c3;">}</span>

acidName<span style="color: #3a81c3;">[</span>charCount<span style="color: #3a81c3;">]</span> = <span style="color: #2d9574;">'\0'</span>;

<span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span>charCount &gt;=<span style="color: #4e3163;">2</span> &amp;&amp; <span style="color: #4e3163;">!</span>strcmp<span style="color: #6c3163;">(</span>&amp;acidName<span style="color: #2d9574;">[</span>charCount - <span style="color: #4e3163;">2</span><span style="color: #2d9574;">]</span>, <span style="color: #2d9574;">"ic"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
  hasEnd = <span style="color: #4e3163;">1</span>;
</pre>
</div>
</div>
</div>
