+posts/lang/c-c++/acid_naming.org
** Connecting the dots...
Let's complete the function, so that it can return suitable flag value based
upon the input:

#+begin_src C
  int checkForAcidName(void) {
    int hasStart = 0;
    int hasEnd = 0;

    int character;
    int charCount;
    char acidName[10001];

    charCount = 0;

    while ((character = getchar()) != '\n') {
      acidName[charCount++] = character;

      if (charCount == 5) {
        if (!strcmp(acidName, "hydro"))
          hasStart = 1;
      }
    }

    acidName[charCount] = '\0';

    if (charCount >=2 && !strcmp(&acidName[charCount - 2], "ic"))
      hasEnd = 1;

    if (hasStart && hasEnd)
      return 1;

    else if (!hasStart && hasEnd)
      return 2;

    return 3;
  }
#+end_src

** Finally, Here comes the ~main~ function!

#+begin_src C
  #include <stdio.h>
  #include <stdlib.h>
  #include <string.h>

  #define HYDRO 1
  #define IC 1

  #define HCLACID 1
  #define POLYACID 2
  #define NOTANACID 3

  int checkForAcidName(void) {
    int hasStart = 0;
    int hasEnd = 0;

    int character;
    int charCount;
    char acidName[10001];

    charCount = 0;

    while ((character = getchar()) != '\n') {
      acidName[charCount++] = character;

      if (charCount == 5) {
        if (!strcmp(acidName, "hydro"))
          hasStart = HYDRO;
      }
    }

    acidName[charCount] = '\0';

    if (charCount >= 2 && !strcmp(&acidName[charCount - 2], "ic"))
      hasEnd = POLYACID;

    if (hasStart && hasEnd)
      return HCLACID;
    
    else if (!hasStart && hasEnd)
      return POLYACID;

    return NOTANACID;
  }

  int main(void) {
    int testCases;

    scanf("%d", &testCases);
    getchar();

    for (int indx = 0; indx < testCases; indx++) {
      int acid = checkForAcidName();

      if (acid == HCLACID)
        puts("non-metal acid");
      else if (acid == POLYACID)
        puts("polyatomic acid");
      else
        puts("not an acid");
    }

    return EXIT_SUCCESS;
  }
#+end_src

