lang/c-c++/acid_naming.html

<div id="outline-container-orgb986950" class="outline-3">
<h3 id="orgb986950">Connecting the dots&#x2026;</h3>
<div class="outline-text-3" id="text-orgb986950">
<p>
Let's complete the function, so that it can return suitable flag value based
upon the input:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #6c3163; font-weight: bold;">checkForAcidName</span><span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">void</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">hasStart</span> = <span style="color: #4e3163;">0</span>;
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">hasEnd</span> = <span style="color: #4e3163;">0</span>;

  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">character</span>;
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">charCount</span>;
  <span style="color: #ba2f59; font-weight: bold;">char</span> <span style="color: #715ab1;">acidName</span><span style="color: #6c3163;">[</span><span style="color: #4e3163;">10001</span><span style="color: #6c3163;">]</span>;

  charCount = <span style="color: #4e3163;">0</span>;

  <span style="color: #3a81c3; font-weight: bold;">while</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>character = getchar<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span> != <span style="color: #2d9574;">'\n'</span><span style="color: #6c3163;">)</span> <span style="color: #6c3163;">{</span>
    acidName<span style="color: #2d9574;">[</span>charCount++<span style="color: #2d9574;">]</span> = character;

    <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>charCount == <span style="color: #4e3163;">5</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
      <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span><span style="color: #4e3163;">!</span>strcmp<span style="color: #b1951d;">(</span>acidName, <span style="color: #2d9574;">"hydro"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
        hasStart = <span style="color: #4e3163;">1</span>;
    <span style="color: #2d9574;">}</span>
  <span style="color: #6c3163;">}</span>

  acidName<span style="color: #6c3163;">[</span>charCount<span style="color: #6c3163;">]</span> = <span style="color: #2d9574;">'\0'</span>;

  <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span>charCount &gt;=<span style="color: #4e3163;">2</span> &amp;&amp; <span style="color: #4e3163;">!</span>strcmp<span style="color: #2d9574;">(</span>&amp;acidName<span style="color: #67b11d;">[</span>charCount - <span style="color: #4e3163;">2</span><span style="color: #67b11d;">]</span>, <span style="color: #2d9574;">"ic"</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
    hasEnd = <span style="color: #4e3163;">1</span>;

  <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span>hasStart &amp;&amp; hasEnd<span style="color: #6c3163;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #4e3163;">1</span>;

  <span style="color: #3a81c3; font-weight: bold;">else</span> <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span><span style="color: #4e3163;">!</span>hasStart &amp;&amp; hasEnd<span style="color: #6c3163;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #4e3163;">2</span>;

  <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #4e3163;">3</span>;
<span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3df120a" class="outline-3">
<h3 id="org3df120a">Finally, Here comes the <code>main</code> function!</h3>
<div class="outline-text-3" id="text-org3df120a">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #6c3163;">#include</span> <span style="color: #3a81c3;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #3a81c3;">&gt;</span>
<span style="color: #6c3163;">#include</span> <span style="color: #3a81c3;">&lt;</span><span style="color: #2d9574;">stdlib.h</span><span style="color: #3a81c3;">&gt;</span>
<span style="color: #6c3163;">#include</span> <span style="color: #3a81c3;">&lt;</span><span style="color: #2d9574;">string.h</span><span style="color: #3a81c3;">&gt;</span>

<span style="color: #6c3163;">#define</span> <span style="color: #715ab1;">HYDRO</span> <span style="color: #4e3163;">1</span>
<span style="color: #6c3163;">#define</span> <span style="color: #715ab1;">IC</span> <span style="color: #4e3163;">1</span>

<span style="color: #6c3163;">#define</span> <span style="color: #715ab1;">HCLACID</span> <span style="color: #4e3163;">1</span>
<span style="color: #6c3163;">#define</span> <span style="color: #715ab1;">POLYACID</span> <span style="color: #4e3163;">2</span>
<span style="color: #6c3163;">#define</span> <span style="color: #715ab1;">NOTANACID</span> <span style="color: #4e3163;">3</span>

<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #6c3163; font-weight: bold;">checkForAcidName</span><span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">void</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">hasStart</span> = <span style="color: #4e3163;">0</span>;
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">hasEnd</span> = <span style="color: #4e3163;">0</span>;

  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">character</span>;
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">charCount</span>;
  <span style="color: #ba2f59; font-weight: bold;">char</span> <span style="color: #715ab1;">acidName</span><span style="color: #6c3163;">[</span><span style="color: #4e3163;">10001</span><span style="color: #6c3163;">]</span>;

  charCount = <span style="color: #4e3163;">0</span>;

  <span style="color: #3a81c3; font-weight: bold;">while</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>character = getchar<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span> != <span style="color: #2d9574;">'\n'</span><span style="color: #6c3163;">)</span> <span style="color: #6c3163;">{</span>
    acidName<span style="color: #2d9574;">[</span>charCount++<span style="color: #2d9574;">]</span> = character;

    <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>charCount == <span style="color: #4e3163;">5</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
      <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span><span style="color: #4e3163;">!</span>strcmp<span style="color: #b1951d;">(</span>acidName, <span style="color: #2d9574;">"hydro"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
        hasStart = HYDRO;
    <span style="color: #2d9574;">}</span>
  <span style="color: #6c3163;">}</span>

  acidName<span style="color: #6c3163;">[</span>charCount<span style="color: #6c3163;">]</span> = <span style="color: #2d9574;">'\0'</span>;

  <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span>charCount &gt;= <span style="color: #4e3163;">2</span> &amp;&amp; <span style="color: #4e3163;">!</span>strcmp<span style="color: #2d9574;">(</span>&amp;acidName<span style="color: #67b11d;">[</span>charCount - <span style="color: #4e3163;">2</span><span style="color: #67b11d;">]</span>, <span style="color: #2d9574;">"ic"</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
    hasEnd = POLYACID;

  <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span>hasStart &amp;&amp; hasEnd<span style="color: #6c3163;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span> HCLACID;

  <span style="color: #3a81c3; font-weight: bold;">else</span> <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span><span style="color: #4e3163;">!</span>hasStart &amp;&amp; hasEnd<span style="color: #6c3163;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span> POLYACID;

  <span style="color: #3a81c3; font-weight: bold;">return</span> NOTANACID;
<span style="color: #3a81c3;">}</span>

<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #6c3163; font-weight: bold;">main</span><span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">void</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">testCases</span>;

  scanf<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"%d"</span>, &amp;testCases<span style="color: #6c3163;">)</span>;
  getchar<span style="color: #6c3163;">()</span>;

  <span style="color: #3a81c3; font-weight: bold;">for</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">indx</span> = <span style="color: #4e3163;">0</span>; indx &lt; testCases; indx++<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">{</span>
    <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">acid</span> = checkForAcidName<span style="color: #2d9574;">()</span>;

    <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>acid == HCLACID<span style="color: #2d9574;">)</span>
      puts<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"non-metal acid"</span><span style="color: #2d9574;">)</span>;
    <span style="color: #3a81c3; font-weight: bold;">else</span> <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>acid == POLYACID<span style="color: #2d9574;">)</span>
      puts<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"polyatomic acid"</span><span style="color: #2d9574;">)</span>;
    <span style="color: #3a81c3; font-weight: bold;">else</span>
      puts<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"not an acid"</span><span style="color: #2d9574;">)</span>;
  <span style="color: #6c3163;">}</span>

  <span style="color: #3a81c3; font-weight: bold;">return</span> EXIT_SUCCESS;
<span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</div>
</div>
